app/Controllers/Dashboard.php

SELECT `tbl_mengelola_invoice`.*, `tbl_input_data_rekanan`.`nama_rek` as `nama_rekanan`, `tbl_mengelola_pemesanan`.`id_so`
FROM `tbl_mengelola_invoice`
LEFT JOIN `tbl_input_data_rekanan` ON `tbl_input_data_rekanan`.`nama_rek` = `tbl_mengelola_invoice`.`nama_rek`
LEFT JOIN `tbl_mengelola_pemesanan` ON `tbl_mengelola_pemesanan`.`id_so` = `tbl_mengelola_invoice`.`pemesanan_id`
WHERE DATE(tbl_mengelola_invoice.tgl_so) = '2025-07-15'
ORDER BY `tbl_mengelola_invoice`.`no_invoice` DESC
---
    private function getRecentInvoices()
    {
        $today = date('Y-m-d');
        return $this->invoiceModel
            ->select('tbl_mengelola_invoice.*, tbl_input_data_rekanan.nama_rek as nama_rekanan, tbl_mengelola_pemesanan.id_so')
            ->join('tbl_input_data_rekanan', 'tbl_input_data_rekanan.nama_rek = tbl_mengelola_invoice.nama_rek', 'left')
            ->join('tbl_mengelola_pemesanan', 'tbl_mengelola_pemesanan.id_so = tbl_mengelola_invoice.pemesanan_id', 'left')
            ->where('DATE(tbl_mengelola_invoice.tgl_so)', $today)
            ->orderBy('tbl_mengelola_invoice.no_invoice', 'DESC')
            ->find();