app/Controllers/Invoice.php

    public function print($no_invoice)
    {
        $invoice = $this->invoiceModel
            ->select('tbl_mengelola_invoice.*, tbl_mengelola_pemesanan.no_po, tbl_input_data_produk.nama_kategori_produk, tbl_input_data_produk.kode_kategori_produk_')
            ->join('tbl_mengelola_pemesanan', 'tbl_mengelola_pemesanan.id_so = tbl_mengelola_invoice.pemesanan_id', 'left')
            ->join('tbl_input_data_produk', 'tbl_input_data_produk.nama_jenis_produk = tbl_mengelola_invoice.nama_jenis_produk', 'left')
            ->where('tbl_mengelola_invoice.no_invoice', $no_invoice)
            ->first();
---
SELECT `tbl_mengelola_invoice`.*, `tbl_mengelola_pemesanan`.`no_po`, `tbl_input_data_produk`.`nama_kategori_produk`, `tbl_input_data_produk`.`kode_kategori_produk_`
FROM `tbl_mengelola_invoice`
LEFT JOIN `tbl_mengelola_pemesanan` ON `tbl_mengelola_pemesanan`.`id_so` = `tbl_mengelola_invoice`.`pemesanan_id`
LEFT JOIN `tbl_input_data_produk` ON `tbl_input_data_produk`.`nama_jenis_produk` = `tbl_mengelola_invoice`.`nama_jenis_produk`
WHERE `tbl_mengelola_invoice`.`no_invoice` = '6'
 LIMIT 1